#include <QApplication> // Головний клас, що керує графічним інтерфейсом програми
#include "game.h"       // Підключаємо наш клас гри

// Глобальний вказівник на об'єкт гри.
// Ми зробили його глобальним, щоб з інших місць (наприклад, з класу Ball)
// можна було звернутися до 'game' і викликати методи типу displayGameOver().
// У великих професійних проектах глобальні змінні не вітаються, але для простих ігор це стандартна практика.
Game *game;

int main(int argc, char *argv[])
{
    // Створюємо об'єкт додатка.
    // Він відповідає за налаштування шрифтів, курсорів, обробку системних подій (кліки, клавіатура)
    QApplication a(argc, argv);

    // Створюємо екземпляр нашої гри.
    // Оскільки Game успадковує QGraphicsView, це фактично створення головного вікна.
    game = new Game();

    // Робимо вікно видимим (за замовчуванням у Qt всі вікна приховані).
    game->show();

    // Запускаємо головний цикл подій (Event Loop).
    // Ця функція "зациклює" програму, змушуючи її чекати на дії користувача (кліки, натискання).
    // Програма не дійде до кінця main(), поки ми не закриємо вікно.
    return a.exec();
}
